/*mondaisetテーブルの確認*/
-- SELECT *
-- FROM mondaiset;

/*mondaiテーブルの確認*/
-- SELECT *
-- FROM mondai;

/*sentakusiテーブルの確認*/
-- SELECT *
-- FROM sentakusi;

/*kaitousetテーブルの確認*/
-- SELECT *
-- FROM kaitouset;

/*データ挿入(kaitouset)*/
-- INSERT INTO kaitouset (id,mondaiset_id,kaisi_nitiji,syuryo_nitiji,sakusei_nitiji) VALUES
-- (1,1,'2021-05-13 09:41:00','2021-05-13 09:42:00','2021-05-13 09:40:00'),
-- (2,2,'2021-05-13 09:43:00','2021-05-13 09:44:00','2021-05-13 09:41:00'),
-- (3,3,'2021-05-13 09:45:00','2021-05-13 09:46:00','2021-05-13 09:42:00'),
-- (4,4,'2021-05-13 09:47:00','2021-05-13 09:48:00','2021-05-13 09:43:00'),
-- (5,5,'2021-05-13 09:49:00','2021-05-13 09:50:00','2021-05-13 09:44:00');

