/*mondaiテーブルの確認*/
-- SELECT *
-- FROM mondaiset;

/*データ挿入*/
-- INSERT INTO mondaiset VALUES (1,'H14春期','2021-05-13 09:40:00');

/*データ挿入*/
-- INSERT INTO mondaiset (id,name,sakusei_nitiji) VALUES
-- (2,'H14春期','2021-05-13 09:41:00'),
-- (3,'H14春期','2021-05-13 09:42:00'),
-- (4,'H14春期','2021-05-13 09:43:00'),
-- (5,'H14春期','2021-05-13 09:44:00');

/*データだけ削除(mondaisetテーブル)*/
-- DELETE FROM mondaiset;

/*データ挿入(mondaisetテーブルに)*/
-- INSERT INTO mondaiset (id,name,sakusei_nitiji) VALUES
-- (1,'H14春期','2021-05-13 09:40:00'),
-- (2,'H14秋期','2021-05-13 09:41:00'),
-- (3,'H15春期','2021-05-13 09:42:00'),
-- (4,'H15秋期','2021-05-13 09:43:00'),
-- (5,'H16春期','2021-05-13 09:44:00');

/*テーブルの確認(mondai)*/
-- SELECT *
-- FROM mondai;

/*データ挿入(mondaiテーブルに)*/
-- INSERT INTO mondai VALUES (1,01,'２進数の 1.1011 と 1.1101 を加算した結果を 10 進数で表したものはどれか。','2021-05-13 10:30:00');

/*データ挿入(mondaiテーブルに)*/
-- INSERT INTO mondai (id,mondaiset_id,mondaibun,sakusei_nitiji) VALUES
-- (1,1,'２進数の 1.1011 と 1.1101 を加算した結果を 10 進数で表したものはどれか。','2021-05-13 10:30:00'),
-- (2,1,'0000 ～ 4999 のアドレスをもつハッシュ表があり， レコードのキー値からアドレスに変換するアルゴリズムとして基数変換法を用いる。 キー値が 55550 のときのアドレスはどれか。 ここで，基数変換法ではキー値を 11 進数と見なし， 10 進数に変換した後， 下４けたに対して 0.5 を乗じた結果（小数点以下は切捨て）をレコードのアドレスとする。','2021-05-13 10:31:00'),
-- (3,1,'４ビットの２進数 1010 の１の補数と２の補数の組合せはどれか。','2021-05-13 10:32:00'),
-- (4,1,'浮動小数点形式で表現される数値の演算において，有効けた数が大きく減少するものはどれか。','2021-05-13 10:33:00'),
-- (5,1,'N 個の観測値の平均値を算出する式はどれか。 ここで， S は N 個の観測値の和（ただし， S ＞0）とし， [ X ] は X 以下で最大の整数とする。 また，平均値は，小数第１位を四捨五入して整数値として求める。','2021-05-13 10:34:00');

/*データだけ削除(mondaiテーブル)*/
-- DELETE FROM mondai;

/*データ挿入(mondaiテーブルに)*/
-- INSERT INTO mondai(id,mondaiset_id,mondaibun,sakusei_nitiji) VALUES
-- (1,2,'16 進数 0.75 と等しいものはどれか。','2021-05-13 10:35:00'),
-- (2,2,'次の計算は何進法で成立するか。131 － 45 ＝ 53','2021-05-13 10:36:00');

/*sentakusiテーブルの確認*/
-- SELECT *
-- FROM sentakusi;

/*問1データ挿入(sentakusi)*/
/*1=ア,2=イ,3=ウ,4=エ*/
-- INSERT INTO sentakusi (id,mondai_id,hyouji_mei,hyouji_jun) VALUES 
-- (1,1,'3.1',1),
-- (2,1,'3.375',2),
-- (3,1,'3.5',3),
-- (4,1,'3.8',4);

/*問2データ挿入(sentakusi)*/
-- INSERT INTO sentakusi (id,mondai_id,hyouji_mei,hyouji_jun) VALUES
-- (5,2,'0260',1),
-- (6,2,'2525',2),
-- (7,2,'2775',3),
-- (8,2,'4405',4);

/*問4データ挿入(sentakusi)*/
-- INSERT INTO sentakusi (id,mondai_id,hyouji_mei,hyouji_jun) VALUES
-- (9,4,'絶対値がほぼ等しく，同符号である数値の加算',1),
-- (10,4,'絶対値がほぼ等しく，同符号である数値の減算',2),
-- (11,4,'絶対値の大きな数と絶対値の小さな数との絶対値による加算',3),
-- (12,4,'絶対値の大きな数と絶対値の小さな数との絶対値による減算',4);

/*問5データ挿入(sentakusi)*/
-- INSERT INTO sentakusi (id,mondai_id,hyouji_mei,hyouji_jun) VALUES
-- (13,5,'[ S ／ N －0.5]',1),
-- (14,5,'[ S ／ N －0.4]',2),
-- (15,5,'[ S ／ N ＋0.4]',3),
-- (16,5,'[ S ／ N ＋0.5]',4);

/*テーブルの確認(mondaiset)*/
-- SELECT *
-- FROM mondaiset;

/*テーブルの確認(mondai)*/
-- SELECT *
-- FROM mondai;

/*テーブルの確認(sentakusi)*/
-- SELECT *
-- FROM sentakusi;

/*mondaiテーブルにデータ挿入(H14秋期)*/
-- INSERT INTO mondai (id,mondaiset_id,mondaibun,sakusei_nitiji) VALUES
-- (6,2,'16 進数 0.75 と等しいものはどれか。','2021-05-14 10:30:00'),
-- (7,2,'次の計算は何進法で成立するか。 131 － 45 ＝ 53','2021-05-14 10:31:00'),
-- (8,2,'負数を２の補数で表す 16 ビットの符号付き固定小数点方式で， 絶対値が最大である数値を 16 進数として表したものはどれか。','2021-05-14 10:32:00'),
-- (9,2,'数多くの数値の加算を行う場合，絶対値の小さなものから順番に計算するとよい。 これはどの誤差を抑制する方法を述べたものか。','2021-05-14 10:33:00'),
-- (10,2,'０～６の数４個で構成される数列（ N 3 ， N 2 ， N 1 ， C ）がある。 C はチェックディジット（検査数字）であり，C ＝（ N 3×4＋ N 2×2＋ N 1×1 ）mod 7
-- を満たす。 ここで a mod b は， a を b で割った余りを表す。 （4，2，□ ，6）が上の条件を満たすとき， □ に当てはまる数はどれか。','2021-05-14 10:34:00');

/*sentakusiテーブルにデータ挿入(H14秋期)*/
-- INSERT INTO sentakusi (id,mondai_id,hyouji_mei,hyouji_jun) VALUES
-- (17,6,'2－2＋2－5＋2－7＋2－8',1),
-- (18,6,'2－2＋2－3＋2－4＋2－6＋2－8',2),
-- (19,6,'2－1＋2－2',3),
-- (20,6,'2－1＋2－2＋2－3＋2－4＋2－6',4),
-- (21,7,'6',1),
-- (22,7,'7',2),
-- (23,7,'8',3),
-- (24,7,'9',4),
-- (25,8,'7FFF',1),
-- (26,8,'8000',2),
-- (27,8,'8001',3),
-- (28,8,'FFFF',4),
-- (29,9,'アンダフロー',1),
-- (30,9,'打切り誤差',2),
-- (31,9,'けた落ち',3),
-- (32,9,'情報落ち',4),
-- (33,10,'0',1),
-- (34,10,'2',2),
-- (35,10,'4',3),
-- (36,10,'6',4);

/*mondaiテーブルにデータ挿入(H15春期)*/
-- INSERT INTO mondai (id,mondaiset_id,mondaibun,sakusei_nitiji) VALUES
-- (11,3,'10 進数の 0.6875 を２進数で表したものはどれか。','2021-05-14 10:35:00'),
-- (12,3,'数値を２進数で格納するレジスタがある。このレジスタに正の整数 x を 入れた後，“レジスタの値を２ビット左にシフトして，これに x を 加える”操作を行うと，レジスタの値は x の何倍になるか。ここで， シフトによるあふれ（オーバフロー）は，発生しないものとする。','2021-05-14 10:36:00'),
-- (13,3,'負数を２の補数で表すとき，８けたの２進数 n に対し－ n を 求める式はどれか。ここで，＋は加算を表し，OR，XOR は，それぞれビットごとの 論理和，排他的論理和を表す。','2021-05-14 10:37:00'),
-- (14,3,'浮動小数点演算において、絶対値の大きな数と絶対値の小さな数の加減算を行ったとき、 絶対値の小さな数の有効けたの一部又は全部が結果に反映されないことを何というか。','2021-05-14 10:38:00'),
-- (15,3,'関数 f(x) は，引数も返却値も実数型である。この関数を使った，① ～ ⑤ から な成る手続を考える。手続を実行開始して十分な回数を繰り返した後に， ③ で表示される y の値に変化がなくなった。このとき成立する関係式はどれか。','2021-05-14 10:39:00');

/*sentakusiテーブルにデータ挿入(H15春期)*/
-- INSERT INTO sentakusi (id,mondai_id,hyouji_mei,hyouji_jun) VALUES
-- (37,11,'0.1001',1),
-- (38,11,'0.1011',2),
-- (39,11,'0.1101',3),
-- (40,11,'0.1111',4),
-- (41,12,'3',1),
-- (42,12,'4',2),
-- (43,12,'5',3),
-- (44,12,'6',4),
-- (45,13,'( n 　OR　10000000) ＋ 00000001',1),
-- (46,13,'( n 　OR　11111110) ＋ 11111111',2),
-- (47,13,'( n 　XOR　10000000) ＋ 11111111',3),
-- (48,13,'( n 　XOR　11111111) ＋ 00000001',4),
-- (49,14,'打切り誤差',1),
-- (50,14,'けた落ち',2),
-- (51,14,'情報落ち',3),
-- (52,14,'絶対誤差',4),
-- (53,15,'f(a) ＝ y',1),
-- (54,15,'f(y) ＝ 0',2),
-- (55,15,'f(y) ＝ a',3),
-- (56,15,'f(y) ＝ y',4);

/*mondaiテーブルにデータ挿入(H15秋期)*/
-- INSERT INTO mondai (id,mondaiset_id,mondaibun,sakusei_nitiji) VALUES
-- (16,4,'２進の浮動小数点表示で誤差を含まずに表現できる 10 進数はどれか。','2021-05-14 10:40:00'),
-- (17,4,'ゼロでない整数の 10 進表示のけた数 D と２進表示のけた数 B との 関係を表す式はどれか。','2021-05-14 10:41:00'),
-- (18,4,' n ビットのすべてが 1 である２進数“1111…11”が表す数値又はその数式はどれか。 ここで，負数は２の補数で表す。','2021-05-14 10:42:00'),
-- (19,4,'コンピュータで連立一次方程式の解を求めるのに，式に含まれる未知数の個数の３乗に 比例する計算時間がかかるとする。 あるコンピュータで 100 元連立一次方程式の解を求めるのに２秒かかったとすると， その４倍の演算速度をもつコンピュータで 1,000 元連立一次方程式の解を求めるときの 計算時間は何秒か。','2021-05-14 10:43:00'),
-- (20,4,'最上位をパリティビットとする８ビット符号において，パリティビット以外の 下位７ビットを得るためのビット演算はどれか。','2021-05-14 10:44:00');

/*sentakusiテーブルにデータ挿入(H15秋期)*/
-- INSERT INTO sentakusi (id,mondai_id,hyouji_mei,hyouji_jun) VALUES
-- (57,16,'0.2',1),
-- (58,16,'0.3',2),
-- (59,16,'0.4',3),
-- (60,16,'0.5',4),
-- (61,17,'D ≒2 log10 B',1),
-- (62,17,'D ≒10 log2 B',2),
-- (63,17,'D ≒ B log2 10',3),
-- (64,17,'D ≒ B log10 2',4),
-- (65,18,'－(2 n －1－1)',1),
-- (66,18,'－1',2),
-- (67,18,'0',3),
-- (68,18,'2 n －1',4),
-- (69,19,'5',1),
-- (70,19,'50',2),
-- (71,19,'500',3),
-- (72,19,'5,000',4),
-- (73,20,'16 進数 0F との AND をとる。',1),
-- (74,20,'16 進数 0F との OR をとる。',2),
-- (75,20,'16 進数 7F との AND をとる。',3),
-- (76,20,'16 進数 FF との XOR （排他的論理和）をとる。',4);

/*mondaiテーブルにデータ挿入(H16春期)*/
-- INSERT INTO mondai (id,mondaiset_id,mondaibun,sakusei_nitiji) VALUES
-- (21,5,'10 進数の演算式 7 ÷ 32 の結果を２進数で表したものはどれか。','2021-05-14 13:00'),
-- (22,5,'次の式は，何進法で成立するか。1015 ÷ 5 ＝ 131　（余り 0 ）','2021-05-14 13:01'),
-- (23,5,'実数 a を a ＝ f × r e と表す浮動小数点表記に関する記述として， 適切なものはどれか。','2021-05-14 13:02'),
-- (24,5,'32 ビットのレジスタに 16 進数 ABCD が入っているとき，２ビットだけ右に 論理シフトしたときの値はどれか。','2021-05-14 13:03'),
-- (25,5,'けた落ちの説明として，適切なものはどれか。','2021-05-14 13:04');

/*sentakusiテーブルにデータ挿入(H16春期)*/
-- INSERT INTO sentakusi (id,mondai_id,hyouji_mei,hyouji_jun) VALUES
-- (77,21,'0.001011',1),
-- (78,21,'0.001101',2),
-- (79,21,'0.00111',3),
-- (80,21,'0.0111',4),
-- (81,22,'6',1),
-- (82,22,'7',2),
-- (83,22,'8',3),
-- (84,22,'9',4),
-- (85,23,' f を仮数， e を指数， r を基数という。',1),
-- (86,23,'f を基数， e を仮数， r を指数という。',2),
-- (87,23,'f を基数， e を指数， r を仮数という。',3),
-- (88,23,'f を指数， e を基数， r を仮数という。',4),
-- (89,24,'2AF3',1),
-- (90,24,'6AF3',2),
-- (91,24,'AF34',3),
-- (92,24,'EAF3',4),
-- (93,25,'値がほぼ等しい浮動小数点数同士の減算において，有効けた数が大幅に減ってしまうことである。',1),
-- (94,25,'演算結果が，扱える数値の最大値を超えることによって生じる誤差である。',2),
-- (95,25,'数表現のけた数に限度があるとき，最小のけたより小さい部分について四捨五入，切上げ又は切捨てを行うことによって生じる誤差である。',3),
-- (96,25,'浮動小数点数の加算において，一方の数値の下位のけたが欠落することである。',4);

/*テーブルの確認*/
-- SELECT *
-- FROM mondaiset;

/*テーブルの確認*/
-- SELECT *
-- FROM mondai;

/*テーブルの確認*/
-- SELECT *
-- FROM sentakusi;


